import {toSingleByteEncoding} from "./_toSingleByteEncoding.ts";

export const toMacRoman = (text: string): ArrayBuffer => {
    return toSingleByteEncoding(text, characters)
}

const characters: Record<string, number> = {
    '\u00C4': 128, // Ä
    '\u00C5': 129, // Å
    '\u00C7': 130, // Ç
    '\u00C9': 131, // É
    '\u00D1': 132, // Ñ
    '\u00D6': 133, // Ö
    '\u00DC': 134, // Ü
    '\u00E1': 135, // á
    '\u00E0': 136, // à
    '\u00E2': 137, // â
    '\u00E4': 138, // ä
    '\u00E3': 139, // ã
    '\u00E5': 140, // å
    '\u00E7': 141, // ç
    '\u00E9': 142, // é
    '\u00E8': 143, // è
    '\u00EA': 144, // ê
    '\u00EB': 145, // ë
    '\u00ED': 146, // í
    '\u00EC': 147, // ì
    '\u00EE': 148, // î
    '\u00EF': 149, // ï
    '\u00F1': 150, // ñ
    '\u00F3': 151, // ó
    '\u00F2': 152, // ò
    '\u00F4': 153, // ô
    '\u00F6': 154, // ö
    '\u00F5': 155, // õ
    '\u00FA': 156, // ú
    '\u00F9': 157, // ù
    '\u00FB': 158, // û
    '\u00FC': 159, // ü
    '\u00DF': 167, // ß
    '\u00C6': 174, // Æ
    '\u00D8': 175, // Ø
    '\u00E6': 190, // æ
    '\u00F8': 191, // ø
    '\u00BF': 192, // ¿
    '\u00A1': 193, // ¡
    '\u00AC': 194, // ¬
    '\u00C0': 203, // À
    '\u00C3': 204, // Ã
    '\u00D5': 205, // Õ
    '\u0152': 206, // Œ
    '\u0153': 207, // œ
    '\u00FF': 216, // ÿ
    '\u0178': 217, // Ÿ
    '\u00C1': 231, // Á
    '\u00CB': 232, // Ë
    '\u00C8': 233, // È
    '\u00CD': 234, // Í
    '\u00CE': 235, // Î
    '\u00CF': 236, // Ï
    '\u00CC': 237, // Ì
    '\u00D3': 238, // Ó
    '\u00D4': 239, // Ô
    '\u00D2': 241, // Ò
    '\u00DA': 242, // Ú
    '\u00DB': 243, // Û
    '\u00D9': 244, // Ù
}
